[
  {
    "icon": "gavel",
    "title": "Official AHS Rebuild Project Page",
    "preview": "<p>All committee and subcommittee meetings are open to the public.</p>\\n",
    "htmltitle": "AHS Building Temp/Phasing",
    "url": "https://ahsbuilding.org/",
    "content": "Official APS homepage for the AHS Rebuild project. Includes a calendar of committee meetings, construction plans and updates, budget information, and more."
  },
  {
    "icon": "gavel",
    "title": "Town Government Committee on AHS Rebuild",
    "preview": "The Town has been accepted into the Massachusetts School Building Authority (MSBA) process for the renovation/reconstruction of Arlington High School. Acceptance by the MSBA ensures that the state, via the MSBA, provides significant financial assistance to the project. View the Arlington High ...",
    "htmltitle": "High School Building Committee | Town of Arlington",
    "url": "https://www.arlingtonma.gov/town-governance/all-boards-and-committees/high-school-building-committee",
    "content": "Official town committee overseeing various parts of the AHS rebuild; includes calendar and agendas for their meetings."
  },
  {
    "icon": "gavel",
    "title": "Official Design Documents",
    "preview": "<p>All committee and subcommittee meetings are open to the public.</p>\\n",
    "htmltitle": "AHS Building Temp/Phasing",
    "url": "https://ahsbuilding.org/at-a-glance/preferred-design-concept/",
    "content": "Town committee page detailing the actual planned design, including link to source documents of design in coordination with MSBA state agency."
  },
  {
    "icon": "money-check-alt",
    "title": "APS Official Budget Information",
    "preview": "FY13 School Committee Presentation - January 27, 2012. • FY13 Budget Timeline - Approved January 26, 2012. • New Massachusetts Educator Evaluations Regulations - November 2011. FISCAL YEAR 2012. FY12 END OF YEAR REPORTS. • FY12 End of Year Report Highlights - October 11, 2012.",
    "htmltitle": "Arlington Public Schools: Administration: Budget Information",
    "url": "http://www.arlington.k12.ma.us/administration/budget/",
    "content": "School department overall budget page, including actual budgets from past years, and detailed financial reporting in some cases."
  },
  {
    "icon": "money-check-alt",
    "title": "APS Budget Visualization",
    "preview": "Arlington Public Schools | Financial & Performance Profile | ClearGov",
    "htmltitle": "Cleargov",
    "url": "https://www.cleargov.com/massachusetts/school/arlington",
    "content": "ClearGov provides a great visualization of the APS budget, staffing levels, student enrollment, and more - all from official town or state source data."
  },
  {
    "icon": "money-check-alt",
    "title": "Official Costing Background Page",
    "preview": "<p>All committee and subcommittee meetings are open to the public.</p>\\n",
    "htmltitle": "AHS Building Temp/Phasing",
    "url": "https://ahsbuilding.org/at-a-glance/cost-funding/",
    "content": "High-level descriptions of the cost, including some links to source documents for actual budget figures for the project."
  },
  {
    "icon": "gavel",
    "title": "Official Facebook Page for AHS Rebuilding ",
    "preview": "Arlington High School Building Project, Arlington, Massachusetts. 523 likes · 19 talking about this. The Arlington High School Building Project encompasses all aspects of the planning and...",
    "htmltitle": "Arlington High School Building Project",
    "url": "https://www.facebook.com/ahsbuilding/",
    "content": "If you prefer Facebook, follow this page for official updates from the town committee for the AHS Rebuild."
  },
  {
    "icon": "newspaper",
    "title": "Your Arlington's Feed of all School News",
    "preview": "",
    "htmltitle": "School news",
    "url": "https://www.yourarlington.com/search/news-archive/371-schools.html",
    "content": "Your Arlington is a local online newspaper; this is their feed of all school-related articles (AHS or otherwise)."
  },
  {
    "icon": "newspaper",
    "title": "Your Arlington | School administrators propose $82.8M budget for fiscal '21 (article)",
    "date": "17-Feb-2020",
    "htmltitle": "School administrators propose $82.8M budget for fiscal '21",
    "url": "https://www.yourarlington.com/arlington-archives/town-school/schools/16735-budget-021720.html",
    "content": "Coverage of the FY21 budget planning and some notes on rebuild status and how plans affect other facilities."
  },
  {
    "icon": "newspaper",
    "title": "Your Arlington | Work on AHS rebuild to begin this month (article)",
    "date": "5-Feb-2020",
    "preview": "UPDATED, Feb. 5: A public forum to discuss site work to rebuild Arlington High School was held Tuesday, Feb. 4, from 7 to 8:30 p.m. at Lowe Auditorium, and an estimated 70 people attended, a number with questions. Site work for the new high school...",
    "htmltitle": "Work on AHS rebuild to begin this month",
    "url": "https://www.yourarlington.com/search/news-archive/371-schools/16622-ahs-011620.html",
    "content": "Coverage of the recent committee meeting on the start of the rebuild project; includes links to past AHS Rebuild stories."
  },
  {
    "icon": "newspaper",
    "title": "Local Cable Channel Coverage of AHS Rebuild",
    "preview": "",
    "htmltitle": "Show: AHS Building Project - Arlington Community Media, Inc.",
    "url": "https://acmi.tv/ahs-building-project/",
    "content": "Our local cable channel ACMi has covered a number of past meetings and stories about the AHS rebuild planning process."
  },
  {
    "icon": "newspaper",
    "title": "ACMi Recordings of School Committee",
    "preview": "",
    "htmltitle": "Show: School Committee Meeting - Arlington Community Media, Inc.",
    "url": "https://acmi.tv/schoolcommittee/",
    "content": "Most School Committee formal meetings are recorded and broadcast on ACMi, they're also saved so you can go back and watch."
  },
  {
    "icon": "newspaper",
    "title": "School-related stories from Wicked Local / Advocate",
    "preview": "",
    "htmltitle": "Education - The Arlington Advocate",
    "url": "https://arlington.wickedlocal.com/news/education",
    "content": "The other local paper's coverage of school related topics, semi-regularly updated. Paywall (only a few free articles a month, unless you subscribe)."
  },
  {
    "icon": "blog",
    "title": "Arts Arlington Supports AHS Rebuild",
    "preview": "At its May meeting, the Arlington Commission for Arts & Culture (ACAC) confirmed its unanimous support for the current Arlington High School (AHS) rebuild design. We regarded it as vital for Arlington, not only to maintain and improve the high-quality education that our town values.  Beyond the safety, accessibility, pedagogical and practical benefits, ACAC also …",
    "htmltitle": "AHS Rebuild Plans Benefit Town Arts & Culture - Arts Arlington",
    "url": "http://artsarlington.org/2019/06/ahs-rebuild-plans-benefit-town-arts-culture/",
    "content": "The Arlington Commission for Arts & Culture group wrote in June 2019 confirming their support for the AHS Rebuild due to the additional ways the design supports arts & culture."
  },
  {
    "icon": "blog",
    "title": "Citizen Group For Saving Historical AHS Facade",
    "preview": "",
    "htmltitle": "Save Our Historic AHS- SOHAHS",
    "url": "https://sites.google.com/view/sohahs/",
    "content": "A citizen's group that advocated for maintaining the historical facade and front green space of the AHS.  (Current building plans do not incorporate this)."
  },
  {
    "icon": "gavel",
    "title": "Arlington Was A MA DOE Green Ribbon Winner",
    "preview": "The goal of the Massachusetts public K-12 education system is to prepare all students for success after high school. Massachusetts public school students are leading the nation in reading and math and are at the top internationally in reading, science, and math according to the national NAEP and international PISA assessments.",
    "htmltitle": "Green Ribbon Schools - School Buildings - School Finance",
    "url": "http://www.doe.mass.edu/finance/sbuilding/greenribbon/",
    "content": "Arlington's schools won a green ribbon award in 2018 for green-focused planning."
  }
]
