[
  {
    "title": "Financial & Budget Information - Overview",
    "preview": "Read information on June 11, 2019 Special Election. Arlington Budget & Financial Information - In this section you will find several of the Town's primary budgetary and financial documents. Below are brief descriptions of these documents and links that will lead to the current year's document as well as ...",
    "url": "https://www.arlingtonma.gov/town-governance/financial-budget-information",
    "content": "On the town's financial homepage there are links to different ways to either visualize the budget, or to see specific kinds of financial reports, like budgets, expenses, audits, the Finance and Capital Planning Committees, and more.",
    "image": "/assets/images/townlogo.png",
    "icon": "money-check"
  },
  {
    "title": "Visualization of Arlington's Budgets/Expenses",
    "preview": "An interactive tool to learn more about the town of Arlington, Massachusetts.",
    "url": "http://arlingtonvisualbudget.org/",
    "content": "Easy-to-use visualizer tool to see where town tax dollars go in a visual map, both in the past and in the future. See either [Revenues](http://arlingtonvisualbudget.org/revenues) or [Expenses](http://arlingtonvisualbudget.org/expenses), and use the year at the top right to explore over time.",
    "icon": "chart-pie",
    "image": "/assets/images/visualbudget.png"
  },
  {
    "title": "Data visualizations/Infographics about Arlington (Cleargov)",
    "preview": "Arlington, MA | Financial & Demographic Profile | ClearGov",
    "url": "https://www.cleargov.com/massachusetts/middlesex/town/arlington",
    "content": "Infographics and simple data visualizations about basic town demographics and finances, including [**comparisons** to other eastern MA towns](https://www.cleargov.com/massachusetts/middlesex/town/arlington/2018/expenditures?breakdowntype=department&objectid=862244) in terms of numbers (financial included).  High level information in a simple to read format.",
    "icon": "table",
    "image": "/assets/images/cleargov.png"
  },
  {
    "title": "Envision Arlington ABC's Of Town Government (pp12)",
    "url": "https://www.arlingtonma.gov/home/showdocument?id=41026",
    "content": "A primer and overview of how town government works, with org charts and descriptions of key town bodies; a great place to start to see which boards/departments do what.",
    "icon": "atlas"
  }, 
  {
    "title": "Arlington's Open Checkbook Of Expenses Paid",
    "preview": "Arlington's Open Checkbook provides financial transparency to the public with easy access to the Town's expenditure information for the current fiscal year, as well as a historical view of previous years. This interactive website can be used to search details of government spending by category, ...",
    "url": "https://www.arlingtonma.gov/town-governance/financial-budget-information/open-checkbook",
    "content": "Checkbook viewer to see actual expenses paid by different town departments - encourages you to explore specific departments, vendors, or dates.  Also includes a separate [Payroll Summary](https://www.arlingtonma.gov/home/showdocument?id=51034).",
    "icon": "file-invoice-dollar",
    "image": "/assets/images/opencheckbook.png"
  },
  {
    "title": "Town Manager's Annual Budget & Financial Reports - Overview",
    "preview": "In accordance with Section 32 of the Town Manager Act; the Town Manager must annually submit a budget to the Select Board. Arlington has had a long tradition of developing a performance based budget that clearly defines departmental goals and objectives and includes detailed trend analysis and ...",
    "url": "https://www.arlingtonma.gov/departments/town-manager/town-manager-s-annual-budget-financial-report",
    "content": "Official Town Manager submitted budgets for the town, as presented to Town Meeting. Includes back to FY2007. Entire budgets are large 250 page PDF documents; starting with individual sections may be easier.",
    "image": "/assets/images/townlogo.png",
    "icon": "money-check"
  },
  {
    "title": "Town Manager's FY2020 Annual Budget & Financial Reports - Overview",
    "preview": "In accordance with Section 32 of the Town Manager Act; the Town Manager must annually submit a budget to the Select Board. Arlington has had a long tradition of developing a performance based budget that clearly defines departmental goals and objectives and includes detailed trend analysis and ...",
    "url": "https://www.arlingtonma.gov/departments/town-manager/town-manager-s-annual-budget-financial-report/fy2020",
    "content": "Town Manager's current FY2020 budget. For a quick 2020 overview, read [Section III Budget Summaries](https://www.arlingtonma.gov/home/showdocument?id=46066) (12 pages).",
    "displaydate": "15-June-2020",
    "icon": "money-check-alt"
  },
  {
    "title": "FY2020 Pay and Classification Plan (Warrant Article 48)(pp17)",
    "url": "https://www.arlingtonma.gov/home/showdocument?id=47342",
    "content": "Detailed salary and pay scales for town employees submitted to Town Meeting, including union and non-union positions.",
    "displaydate": "15-June-2020",
    "icon": "money-check-alt"
  },
  {
    "title": "APS Official School Budget Information",
    "preview": "FY13 School Committee Presentation - January 27, 2012. • FY13 Budget Timeline - Approved January 26, 2012. • New Massachusetts Educator Evaluations Regulations - November 2011. FISCAL YEAR 2012. FY12 END OF YEAR REPORTS. • FY12 End of Year Report Highlights - October 11, 2012.",
    "url": "http://www.arlington.k12.ma.us/administration/budget/",
    "content": "School department overall budget page, including actual budgets from past years, and detailed financial reporting in some cases. The School budget is the largest in town, and is managed by the School Committee directly.",
    "related": "/meetings/school/",
    "icon": "school",
    "image": "/assets/images/ahs.jpg"
  },
  {
    "title": "APS FY21 School Superintendent Budget to Town Meeting (pp79)",
    "url": "https://www.arlington.k12.ma.us/administration/budget/fy21/fy21budgettownmeeting06-15-20.pdf",
    "content": "FY21 requested School Budget approved by School Committee and submitted to Town Meeting, with complete details.",
    "displaydate": "15-June-2020",
    "related": "/meetings/school/#2020-06-11",
    "icon": "school",
    "image": "/assets/images/ahs.jpg"
  },
  {
    "title": "APS Draft Five-Year Budget Plan 2020-2024 (pp25)",
    "url": "https://www.arlington.k12.ma.us/administration/budget/fy20/fiveyeardraftapsbudgetplan.pdf",
    "content": "High-level five year plan for school budgets, with projections for enrollment and maintenance.",
    "displaydate": "11-April-2019",
    "related": "/meetings/school/#2020-04-11",
    "icon": "school",
    "image": "/assets/images/ahs.jpg"
  },
  {
    "title": "Capital Planning Cmmtee Reports to Town Meeting",
    "preview": "Capital Planning Reports Submitted to Town Meeting The Capital Planning Committee was established by the 1986 Arlington Town Meeting to assist the Town Manager in preparing a multi-year capital plan. The Capital Planning Committee prepares a report to Town Meeting that contains detailed ...",
    "url": "https://www.arlingtonma.gov/town-governance/all-boards-and-committees/capital-planning-committee/reports-to-town-meeting",
    "content": "The Capital Planning Committee was established by the 1986 Arlington Town Meeting to assist the Town Manager in preparing a multi-year capital plan. The Capital Planning Committee prepares a report to Town Meeting that contains detailed financial information relating to Arlington’s multi-year Capital Improvement Program.",
    "related": "/townhall/#capital-planning-committee",
    "icon": "money-check"
  },
  {
    "title": "Finance Committee Homepage",
    "preview": "View past Finance Committee Meetings on ACMi. The Arlington Finance Committee (FinCom) is a standing committee of the Town Meeting. Its purpose is to recommend a vote to Town Meeting on the Town budget and all articles that require an appropriation. The FinCom reviews each department's ...",
    "url": "https://www.arlingtonma.gov/town-governance/all-boards-and-committees/finance-committee",
    "content": "The Arlington Finance Committee (FinCom) is a standing committee of the Town Meeting. Its purpose is to recommend a vote to Town Meeting on the Town budget and all articles that require an appropriation. The FinCom reviews each department's budget in detail and holds hearings on Town Meeting appropriation articles...",
    "related": "/townhall/#finance-committee",
    "icon": "gavel"
  },
  {
    "title": "Assessor's Office - Property & Excise Tax Information",
    "preview": "TAX RECAPITULATION SHEETS. TAX RATE GROWTH REPORTS (LA-13). CLASS CODE TOTALS & COUNTS (LA-4). 2015 · 2015 · 2015 · 2014 · 2014 · 2014 · 2013 · 2013 · 2013 · 2012 · 2012 · 2012 · 2011 · 2011 · 2011 · 2010 · 2010 · 2010 · 2009 · 2009 · 2009 · 2008 · 2008 · 2008 · 2007 · 2007 · 2007.",
    "url": "https://www.arlingtonma.gov/departments/assessor/tax-information",
    "content": "Assessor office homepage with formal tax classifications about propery, excise (cars), and other town taxes.",
    "related": "/townhall/#board-of-assessors",
    "icon": "money-bill-wave"
  },
  {
    "title": "Treasurer/Collector Homepage And Tax Payments",
    "preview": "The Office of the Treasurer and Collector of Taxes consists of five divisions headed by the Treasurer/Collector of Taxes. The five divisions are: Treasury, Collector, Payroll, Parking Clerk, and service support divisions. The Town Treasurer and Collector of Taxes is responsible for managing and directing ...",
    "url": "https://www.arlingtonma.gov/departments/treasurer",
    "content": "The Office of the Treasurer and Collector of Taxes consists of five divisions headed by the Treasurer/Collector of Taxes. The five divisions are: Treasury, Collector, Payroll, Parking Clerk, and service support divisions. Includes explanations of property taxes and ways to pay town bills.",
    "icon": "money-bill-wave"
  },
  {
    "title": "Census & Demographic Data Visualizations for Arlington (DataUSA)",
    "preview": "In 2017, Arlington, MA had a population of 45k people with a median age of 41.4 and a median household income of $103,594. Between 2016 and 2017 the population of Arlington, MA grew from 44,408 to 44,992, a 1.32% increase and its median household income grew from $98,103 to $103,594, a 5.6% increase.",
    "url": "https://datausa.io/profile/geo/arlington-ma/",
    "content": "Another data visualizer, focusing on showing detailed charts and year-over-year changes drawing on many different US Census and other official sources.",
    "icon": "chart-pie"
  },
  {
    "title": "Municipal Finance Trends Dashboard - Comparisons",
    "preview": "Key Municipal Fiscal Health Indicators",
    "url": "https://www.mass.gov/service-details/municipal-finance-trend-dashboard",
    "content": "MA State dashboard comparing basic financials across different communities, and includes the [Community Comparison Report](https://www.mass.gov/service-details/at-a-glance-and-community-comparison-reports) to choose which towns to compare.",
    "icon": "table"
  },
  {
    "title": "Audited Financial Statements For Arlington",
    "preview": "The Town of Arlington annually contracts with a private auditing firm for the purposes of auditing the Town's accounts, funds and preparing financial statements for all governmental activities.The audit is conducted in accordance with the applicable standards contained in the Government Auditing ...",
    "url": "https://www.arlingtonma.gov/departments/comptroller/audited-financial-statements",
    "content": "The Town of Arlington annually contracts with a private auditing firm for the purposes of auditing the Town’s accounts, funds and preparing financial statements for all governmental activities; results of audits since 2001 are posted here.",
    "icon": "receipt"
  },
  {
    "title": "Town Employees' Homepage And Handbook",
    "preview": "Please Note: While understanding of the HRA as described in video above has not changed, Sentinel Benefits is no longer our plan administrator. We now have Navia Benefits Administer the plan for us. Their website is https://www.naviabenefits.com/ .",
    "url": "https://www.arlingtonma.gov/departments/human-resources/for-employees",
    "content": "Town civil service pay grades, employee handbook, job benefits, and more from the town's HR department.",
    "icon": "gavel"
  },
  {
    "title": "ACMi Video Coverage Of Finance Committee Meetings",
    "url": "http://acmi.tv/financecommittee/",
    "content": "ACMi records all regular Finance Committee Meetings when they meet in early spring to review the budget before town meeting.",
    "image": "/assets/images/acmilogo.jpg",
    "icon": "newspaper"
  },
  {
    "title": "Fiscal '21 manager's budget could change at Town Meeting",
    "preview": "As the public got its first look at the manager's fiscal 2021 budget at the Monday, Jan. 27, Select Board meeting, they saw that the plan arrives with some key initiatives: • More public-works staff, with the addition of a permit engineer and a...",
    "url": "https://yourarlington.com/search/news-archive/31-finance/16664-budget-012820.html",
    "content": "News coverage of potential changes due to COVID in FY21 proposed budget from the Town Manager.",
    "icon": "newspaper",
    "image": "/assets/images/yourarlington.png",
    "displaydate": "25-April-2020"
  },
  {
    "title": "Fiscal '21 town budget aims to boost DPW, school officer, librarian, records",
    "preview": "As the public got its first look at the manager's fiscal 2021 budget at the Monday, Jan. 27, Select Board meeting, they saw that the plan arrives with some key initiatives: • More public-works staff, with the addition of a permit engineer and a...",
    "url": "https://www.yourarlington.com/arlington-archives/town-school/selectboard/16664-budget-012820.html",
    "content": "News coverage of the FY21 proposed budget from the Town Manager.",
    "icon": "newspaper",
    "date": "20200128",
    "image": "/assets/images/yourarlington.png",
    "displaydate": "28-Jan-2020"
  },
  {
    "title": "$24.7M in cuts bring budget for rebuilt AHS into line",
    "preview": "Keeping turf fields, cutting bikeway connection UPDATED, Dec. 21: The building committee, sharpening its rough-cut diamond of a budget for a rebuilt Arlington High School, this week cut $24.7 million, to bring expected costs back into alignment. To...",
    "url": "https://www.yourarlington.com/search/news-archive/371-schools/16509-ahs-122019.html",
    "content": "News coverage of AHS rebuild budget cuts to reduce costs; includes links to past news stories on AHS rebuild issues.",
    "icon": "newspaper",
    "date": "20191221",
    "image": "/assets/images/yourarlington.png",
    "displaydate": "21-Dec-2019"
  },
  {
    "title": "Town tax rate drops again, as values continue to rise",
    "preview": "The tax rate in Arlington for fiscal 2020 is dropping to $11.06 per $1,000 of assessed value, 20 cents below the current year, after the Select Board voted unanimously Monday, Dec. 2, to accept an assessors' report. Mary Winstanley O'Connor, a...",
    "url": "https://www.yourarlington.com/arlington-archives/town-school/selectboard/16433-taxes-120419.html",
    "content": "News story reviewing how the property tax rate is dropping, due to assessed values going up as a whole.",
    "icon": "newspaper",
    "date": "20191204",
    "image": "/assets/images/yourarlington.png",
    "displaydate": "04-Dec-2019"
  },
  {
    "title": "Arlington Town Salaries: Who Made The Most In 2018?",
    "preview": "See who the top earners were among town employees last year.",
    "url": "https://patch.com/massachusetts/arlington/arlington-town-salaries-who-made-most-2018",
    "content": "News coverage on published 2018 town employee salaries, commenting on highest earners, and linking to a complete town salary list.",
    "icon": "chart-pie",
    "date": "20190213",
    "displaydate": "13-Feb-2019"
  },
  {
    "title": "Select Board commits to June debt exclusion, operating override",
    "preview": "“We’re using foresight and planning for what we know is coming down the pike.\" -- Joe Curro UPDATED, Jan. 25: Arlington’s Select Board confirmed its commitment to the 2019 debt exclusion and operating override, as unanimously approved at its...",
    "url": "https://www.yourarlington.com/arlington-archives/town-school/selectboard/15319-votes-012419.html",
    "content": "News about the Select Board's actions around the preliminary FY20 budget, with discussion or debt exclusions.",
    "icon": "newspaper",
    "date": "20190124",
    "image": "/assets/images/yourarlington.png",
    "displaydate": "24-Jan-2019"
  }
]
