[
  {
    "title": "ARB Meeting Agenda And Reference Documents",
    "preview": "7:30 p.m. - 8:30 p.m.. Board will continue hearing for Special Permit Docket #3602 to review application by James F. Doherty for 1211 Mass Ave Realty Trust, at 1207-1211 Massachusetts Avenue, Arlington, MA, 02476, to construct a 50 room hotel and restaurant at 1207-1211 Massachusetts Avenue ...",
    "htmltitle": "Coversheet",
    "url": "https://arlington.novusagenda.com/agendapublic/CoverSheet.aspx?ItemID=8400&MeetingID=989",
    "content": "Formal agenda item for review of developer's updated plans for Hotel Lexington. Click through to see various correspondences between the ARB, the developer, and others. Key items are Agenda items 1F/1G, which are from the developer about specific issues ."
  },
  {
    "title": "ARB Documents About Hotel Lexington Plans",
    "preview": "The continued public hearing will occur on March 16, 2020, room TBD. Notice is herewith given that an application has been filed on June 21, 2019, by James F. Doherty for 1211 Mass Ave Realty Trust, at 1207-1211 Massachusetts Avenue, Arlington, MA, 02476, for Special Permit Docket #3602 in ...",
    "htmltitle": "Environmental Design Review Docket 3602, 1207-1211 Massachusetts Avenue",
    "url": "https://www.arlingtonma.gov/Home/Components/News/News/9931/3864?backlist=/town-governance/all-boards-and-committees/redevelopment-board",
    "content": "The ARB's continued public hearing will occur on March 16, 2020, room TBD.",
    "icon": "gavel",
    "date": "20200316",
    "displaydate": "16-Mar-2020"

  },
  {
    "title": "The Heights Hotel Part V - What is Wrong with this Picture?",
    "preview": "The second hearing for the Hotel Lexington was held on Monday, January 27.  There was a good turnout of residents to observe and offer their views.   You can watch the entire hearing here or just the public comments. After a six month wait, we saw what the architects have been working on. -New materials for the facade. -A small circular driveway in front. -A shrunken parking lot in the rear that will be valet only. Still missing is the topographical survey that should have been provided on Day One. The architects have also provided renderings of what the hotel will look like from Mass Ave Architect's Rendering of what Hotel should look like It seems to fit well into the neighborhood, almost unobtrusive.   But is it real?   What is wrong with this picture?   Hint - count the utility poles.  Start with Pole A in front of Nicola's.  The hotel starts at around Pole B.  The circular driveway and canopy should be between Poles C and D.  Pole D, directly in front of the DAV building, marks the far end of the proposed hotel.  And the hotel is taller than those 40' utility poles. It is clear that the architects have provided a visualization that is grossly inaccurate, showing an undersized building that occupies only a fraction of the total footprint.  At the next hearing, March 16, they will have a lot of explaining to do.    Google Street View View of lot between Poles B and C   View of lot between Poles C and D   How the Architect's Rendering compares to actual lot plan",
    "htmltitle": "The Heights Hotel Part V - What is Wrong with this Picture?",
    "url": "https://blog-arfrr.blogspot.com/2020/02/the-heights-hotel-part-v-what-is-wrong.html",
    "content": "The second hearing for the Hotel Lexington was held on Monday, January 27.  There was a good turnout of residents to observe and offer their views. (Includes important ARFRR commentary)",
    "icon": "blog",
    "date": "20200203",
    "displaydate": "03-Feb-2020"
  },
  {
    "title": "Proposed Heights hotel-restaurant draws opposition",
    "preview": "Hotel mockup, Mass. Ave. eastbound. / Lincoln Architects Board waives part of special-permit fee, questions developer updates, hears zoning concerns The Redevelopment Board took action on one aspect of the 50-room boutique hotel and upscale...",
    "htmltitle": "Proposed Heights hotel-restaurant draws opposition",
    "url": "https://www.yourarlington.com/arlington-archives/town-school/planning/16673-hotel-013020.html",
    "content": "The Redevelopment Board took action on one aspect of the 50-room boutique hotel and upscale restaurant planned for 1207-1211 Mass. Ave., the current site of automotive businesses and the Disabled American Veterans building. ",
    "icon": "newspaper",
    "date": "20200130",
    "displaydate": "30-Jan-2020"
  },
  {
    "title": "Arlington Redevelopment Board - Jan 27th, 2020 -",
    "preview": "Arlington Redevelopment Board - Jan 27th, 2020. From srevilak.net. Jump to: navigation, search. Docket 3602, 1207--1211 Mass Ave. The applicant is James Doherty. He's represented by attorney Mary Winstanley-O'Connor. Greg Macintosh is the architect. Mr. Macintosh presents the updated proposal.",
    "htmltitle": "Arlington Redevelopment Board - Jan 27th, 2020 -",
    "url": "https://www.srevilak.net/wiki/Arlington_Redevelopment_Board_-_Jan_27th,_2020",
    "content": "Notes from ARB meeting on Hotel Lexington and other matters (Apotheca, citizen petitions) by Steve Revilak.",
    "icon": "blog",
    "date": "20200127",
    "displaydate": "27-Jan-2020"
  },
  {
    "title": "The Heights Hotel Part IV - Is the Wait Over?",
    "preview": "The Heights Hotel Part IV - Is the Wait Over?     A QUICK RECAP on the \"Hotel Lexington\" project.  The last real news goes way back to July 22 when residents gathered in the Lyons Room to hear the proposal and provide their concerns.  The developer left with a long list of potential problems and zoning issues to resolve.  The Redevelopment Board was left with the thorny legal issue of waiving both special permit fees and future inspection fees.  Some of these fees are set down in our bylaws by Town Meeting but were somehow negotiated away by the Town Manager and the Planning Department.  Tomorrow's hearing will address the fairly modest $5400 special permit fee but leave unaddressed the substantial inspection fees which could easily top $100,000. After six months of cancelled hearings, the developer is back with a revised plan.  Most of the newly submitted material is about parking and traffic.  There will be no self-parking spots provided for either hotel guests or restaurant patrons.  All parking will be by valet.  The hotel is being pushed back about 12 feet to accommodate a small semi-circular driveway in front for pickup and drop-off.  This extra setback is a big improvement when viewed from the Mass Ave.  Not so good for the folks who live on Peirce St.  The back of the hotel will now be 12 feet closer to your backyards. The traffic study makes interesting reading.  For the before and after traffic estimates, the long abandoned Disabled American Veterans club is modeled as a high turnover sit down restaurant and is being counted for current traffic volume.  Apparently six years ago it had a small kitchen in the back. Environmentalists may be alarmed to discover that landscaped open space now means pervious brick rather than plantings. What is remarkable about the materials submitted for Monday’s hearing is not what is there but what is missing. Several serious zoning problems were raised at the July hearing but the applicant has chosen to completely ignore them, perhaps hoping that they will be forgotten.  Nothing has been done on the Clark St setback requirement. The planned upper story stepback continues to be a floor too high. And there still isn’t a single square foot of the required usable open space.  The developer continues to ask for an exemption from the floor area ratio requirements even though the bylaw explicitly denies the Board the authority to make such an exception for this size property.   And then there is the elephant in the room that no one will address - a hotel use is simply not allowed in a B2 zone.    The hearing is scheduled for Monday, January 27 in the Senior Center.  Hopefully the organizers have learned from last time and will arrange for microphones so that the public can hear what is being presented.  It would also be nice to have a projector and screen instead of flip charts so that we can actually see the drawings being discussed.",
    "htmltitle": "The Heights Hotel Part IV - Is the Wait Over?",
    "url": "https://blog-arfrr.blogspot.com/2020/01/the-heights-hotel-part-iv-is-wait-over.html",
    "content": "A QUICK RECAP on the \"Hotel Lexington\" project.  The last real news goes way back to July 22 when residents gathered in the Lyons Room to hear the proposal and provide their concerns.  The developer left with a long list of potential problems and zoning issues to resolve. ",
    "icon": "blog",
    "date": "20200124",
    "displaydate": "24-Jan-2020"
  },
  {
    "title": "ARFRR Blog about developer's delays in ARB hearings",
    "preview": "A  blog watching and commenting on developments in redevelopment in Arlington, MA, USA",
    "htmltitle": "The ARFRR Blog",
    "url": "https://blog-arfrr.blogspot.com/2019/",
    "content": "Once again the next hearing has been cancelled.  Attorney Mary Winstanley O'Conner has written to the Redevelopment Board asking that it be continued to January 27th, without explanation of reason of the delay or why the developer waited so long to make this last minute request.",
    "icon": "blog",
    "date": "20191204",
    "displaydate": "04-Dec-2019"
  },
  {
    "title": "ARFRR Report on first ARB meeting ",
    "preview": "A  blog watching and commenting on developments in redevelopment in Arlington, MA, USA",
    "htmltitle": "The ARFRR Blog",
    "url": "https://blog-arfrr.blogspot.com/2019/08/",
    "content": "Back on July 22, the Redevelopment Board correctly anticipated the strong neighborhood interest in the proposal for a boutique hotel on two lots at 1207-1211 Mass Ave and moved the hearing to the larger Lyons Conference Room.  Even so, it was standing room only with some of the crowd spilling out into the hallway.",
    "icon": "blog",
    "date": "20190814",
    "displaydate": "14-Aug-2019"
  },
  {
    "title": "Board, residents pepper proposed hotel with comments",
    "preview": "5 opposed, 3 favored, 11 questioned UPDATED, Aug. 9: The second hotel proposed for the town drew requests for a range of fresh detail from the Redevelopment Board as well as pointed comments from 19 of about 50 residents on Monday, July 22. The...",
    "htmltitle": "Board, residents pepper proposed hotel with comments",
    "url": "https://www.yourarlington.com/arlington-archives/town-school/planning/15929-hotel-072619",
    "content": "The second hotel proposed for the town drew requests for a range of fresh detail from the Redevelopment Board as well as pointed comments from 19 of about 50 residents on Monday, July 22.",
    "icon": "newspaper",
    "date": "20190809",
    "displaydate": "09-Aug-2019"
  },
  {
    "title": "Hearing held for town's 2nd hotel proposed near Heights",
    "preview": "Hotel mockup, Mass. Ave. eastbound. / Lincoln Architects UPDATED, July 26: An estimated 50 people attended a hearing Monday, July 22, for a propose second hotel in Arlington, at the site of the long-closed Disabled American Veterans social club and...",
    "htmltitle": "Hearing held for town's 2nd hotel proposed near Heights",
    "url": "https://www.yourarlington.com/arlington-archives/town-school/planning/15904-hotel-071519.html",
    "content": "An estimated 50 people attended a hearing Monday, July 22, for a propose second hotel in Arlington, at the site of the long-closed Disabled American Veterans social club and a currently open automotive repair shop in the Heights. ",
    "icon": "newspaper",
    "date": "20190723",
    "displaydate": "23-Jul-2019"
  },
  {
    "title": "Notes on ARB meeting by Steve Revilak",
    "preview": "After attending part of the Select Board meeting, I walked down the hall to where the Redevelopment board was holding a hearing on Docket 3602, 1207--1211 Mass Ave. A developer is proposing to construct a hotel on two parcels on Mass Ave. The 1211 parcel is currently owned by the developer; the ...",
    "htmltitle": "Arlington Redevelopment Board - Jul 22nd, 2019 -",
    "url": "https://www.srevilak.net/wiki/Arlington_Redevelopment_Board_-_Jul_22nd,_2019",
    "content": "A developer is proposing to construct a hotel on two parcels on Mass Ave. The 1211 parcel is currently owned by the developer; the 1207 parcel is a former Disabled American Veterans Club building, which is owned by the town. The developer is interested in purchasing the property from the town, contingent upon being granted a special permit to build the hotel.",
    "icon": "blog",
    "date": "20190722",
    "displaydate": "22-Jul-2019"
  },
  {
    "title": "Hotel proposed for 1211 Massachusetts Ave. - News - The Arlington Advocate - Arlington, MA",
    "preview": "",
    "htmltitle": "Hotel proposed for 1211 Massachusetts Ave. - News - The Arlington Advocate - Arlington, MA",
    "url": "https://arlington.wickedlocal.com/news/20190722/hotel-proposed-for-1211-massachusetts-ave",
    "content": "Article on original Hotel Lexington proposal (Paywall) ",
    "icon": "newspaper",
    "date": "20190722",
    "displaydate": "22-July-2019"
  },
  {
    "title": "Original ARB meeting on Hotel Lexington",
    "preview": "7:30 p.m. - 8:30 p.m., Board will open Special Permit Docket #3602 to review application by James F. Doherty for 1211 Mass Ave Realty Trust, at 1207-1211 Massachusetts Avenue, Arlington, MA, 02476, to construct a 50 room hotel and restaurant at 1207-1211 Massachusetts Avenue within the B2 ...",
    "htmltitle": "Coversheet",
    "url": "https://arlington.novusagenda.com/agendapublic/CoverSheet.aspx?ItemID=7680&MeetingID=922",
    "content": "Click through to see developer's original planning documents for the hotel.",
    "icon": "gavel",
    "date": "20190722",
    "displaydate": "22-Jul-2019"
  },
  {
    "title": "The Heights Hotel - History and Details",
    "preview": "1207 Mass Ave - Proposed Hotel Site  The Heights Hotel - History and Details  In our blog entry this week, we look at the hotel currently proposed at 1207 Mass Ave.    There is a meeting on this issue on July 22nd (this) Monday night  at the Arlington Redevelopment Board (ARB) session at the Town Hall Annex 2nd floor conference room. It was news to many Arlington residents this week that the Town was negotiating the development of a hotel on Mass Ave in the Heights.  Actually, it has been a long drawn out process that has not gone as first envisioned.  Here is the background story… It starts about six years ago when the Select Board discovered to its great surprise that it had owned the land at 1207 Mass Ave for more than a century and was landlord to the soon to be vacated Disabled American Veterans club.  A working group was formed, including Selectman Steven Byrne, to figure out what to do with this newly found asset. They looked first at ways to utilize it as a town building for office or meeting space.  They considered it for a food pantry site.  There was much talk of a shared space/incubator. They looked at rental options.  The Select Board concluded that the best option was to simply sell it outright and use the money to help pay for the Stratton School renovations.  They went before the 2015 spring Town Meeting with their case and received approval to dispose of 1207 Mass Ave. The optimistic view presented to Town Meeting was that the sale might realize $1M or more, and the 2016 fiscal year Capital Plan actually earmarked that amount for paying for Stratton School costs. Four years later, the funds from a sale have still not materialized. The first round of RFP bidding did not go well, with a few nibbles but no bids.  The Town lowered its asking price to $750K and in late 2016 received one offer from the owner of an abutting property. The Select Board had to deal with an awkward situation.  The sole bidder was James Doherty who had been on the Board of Assessors during the early days of the process.  He had purchased 1211 Mass Ave next door just a few years earlier, and the town lot was probably more valuable to him than other buyers because of the development possibilities.  His proposal was based upon the new mixed use bylaw passed by Town Meeting in 2016.  He proposed combining first floor retail with some sort of residential use above, specifying either apartments or a small hotel.  The latter was particularly attractive to the Select Board with its promise of revenue from hotel occupancy taxes.  Remarkably, no one seems to have noticed that the hotel use was prohibited in the B2 district of the DAV lot. The awkwardness of the sale arose from selling town land to an \"insider,\" a recent member of the Board of Assessors who also had a personal connection to a Selectman who had served on the working group exploring options for either keeping or selling the property.  The Select Board handled it with great delicacy.  Selectman Byrne properly recused himself quietly from deliberations and voting in March 2017, and the name of the buyer was not uttered during the meeting.  The Town Manager was authorized to enter into negotiations. The negotiations dragged out for a year and a half, finally concluding with a Purchase & Sale agreement last fall.  The buyer ended up with a very nice deal for himself, receiving a waiver of all special permit and building fees.  In appearing before the Redevelopment Board next week, he will not pay the approximately $5K fee set by the Board.  Going forward, he will not pay any building permit fees.   This is not chump change.  For a project of this size, the building permit fees will amount to many tens of thousands of dollars, likely topping $100K.  It is not clear that the Select Board or Town Manager even has the authority to waive these fees; they are set down in the Town bylaws.  It also seems that if the developer does not get the Special Permit he seeks, he can back out of the deal and the Town gets nothing for its efforts of the last five years. And that sets the playing field for next Monday’s hearing...",
    "htmltitle": "The Heights Hotel - History and Details",
    "url": "https://blog-arfrr.blogspot.com/2019/07/the-heights-hotel-history-and-details.html",
    "content": "It was news to many Arlington residents this week that the Town was negotiating the development of a hotel on Mass Ave in the Heights.  Actually, it has been a long drawn out process that has not gone as first envisioned.  Here is the background story…",
    "icon": "blog",
    "date": "20190720",
    "displaydate": "20-Jul-2019"
  },
  {
    "title": "Developer Releases More Details About Proposed Arlington Hotel",
    "preview": "A proposed four-story, 50-room hotel with an upscale restaurant will go before the Redevelopment Board on Monday.",
    "htmltitle": "Developer Releases More Details About Proposed Arlington Hotel",
    "url": "https://patch.com/massachusetts/arlington/developer-releases-more-details-proposed-arlington-hotel",
    "content": "The developer behind a proposed boutique hotel in Arlington Heights has released more details about the project ahead of a Redevelopment Board hearing July 22. ",
    "icon": "newspaper",
    "date": "20190719",
    "displaydate": "19-Jul-2019"
  },
  {
    "title": "Memo on Hotel Lexington Plans from Developer",
    "preview": "Hotel memo",
    "htmltitle": "Boutique Hotel | Parking | Ownership",
    "url": "https://www.scribd.com/document/418794972/Boutique-Hotel",
    "content": "Detailed letter by the developer of plans and replies to questions from the ARB and town.",
    "icon": "blog",
    "date": "20190718",
    "displaydate": "18-Jul-2019"
  },
  {
    "title": "Boutique Hotel, Restaurant Proposed for Arlington",
    "preview": "A new hotel could be on its way to the northwest suburbs of Boston, and it may include a restaurant and/or bar. An article in YourArlington confirms what we were told by a source last week, that a boutique hotel is being proposed for the former Disabled American Veterans site and the still-running Precision Tire and Alignment on Mass. Ave. on the eastern edge of Arlington Heights, with the post saying that the four-story hotel would have 50 rooms and an upscale dining spot. Our source tells us that the ground-floor restaurant could actually be some sort of brewpub or tavern, though no specific details have been given as of yet; a hearing on the proposal is scheduled to take place on Monday, July 22, so more information on the dining/drinking spot (and the hotel) should be known by next week. The address for the DAV was 1207 Mass. Ave., while the address for Precision Tire and Alignment is 1211 Mass. Ave.; the two properties are about a block east of the Mass. Ave./Lowell Street fork. [July 23 update: A meeting at Town Hall last night gave some additional information on the proposal, including the fact that the plan is indeed to open an upscale restaurant on the main floor of the hotel, though the plans are in their initial stages for both the hotel and the restaurant, so things could change as more meetings take place.] by Marc Hurwitz (Also follow us on Twitter at @hiddenboston)  [A related post from our sister site (Boston's Hidden Restaurants): List of Restaurant Closings and Openings in the Boston Area]",
    "htmltitle": "Boutique Hotel, Restaurant Proposed for Arlington",
    "url": "https://bostonrestaurants.blogspot.com/2019/07/boutique-hotel-restaurant-proposed-for.html",
    "content": "An article in YourArlington confirms what we were told by a source last week, that a boutique hotel is being proposed for the former Disabled American Veterans site and the still-running Precision Tire and Alignment on Mass. Ave. on the eastern edge of Arlington Heights, with the post saying that the four-story hotel would have 50 rooms and an upscale dining spot.",
    "icon": "newspaper",
    "date": "20190715",
    "displaydate": "15-Jul-2019"
  }
]
