[
  {
    "status": "closed",
    "statusdate": "17-March",
    "type": "public",
    "name": "Boston Public Library",
    "description": "Boston Public Library locations closed.  All due dates, fines, and library card expirations are extended. BPL offers many online resources!",
    "address": "700 Boylston Street, Boston MA 02116",
    "telephone": "617-536-5400",
    "url": "https://www.bpl.org/",
    "twitterurl": "https://twitter.com/bplboston",
    "hoursurl": "https://www.bpl.org/locations/3/",
    "title": "Boston Public Library"
  },
  {
    "status": "closed",
    "statusdate": "17-March",
    "type": "public",
    "name": "Ashland Public Library",
    "description": "The Ashland Public Library provides free access to information in a variety of formats to stimulate creativity, critical thinking and lifelong learning.  We strive to be responsive to the diverse cultural, educational and recreational needs of a growing community.",
    "address": "66 Front St., Ashland, MA 01721",
    "telephone": "508-881-0134",
    "url": "https://www.ashlandmass.com/184/Ashland-Public-Library",
    "twitterurl": "https://twitter.com/minlibnet",
    "hoursurl": "https://www.ashlandmass.com/184/Ashland-Public-Library",
    "title": "Ashland Public Library"
  },
  {
    "status": "closed",
    "statusdate": "17-March",
    "type": "public",
    "name": "Holliston Public Library",
    "description": "**CLOSED as of 18-March, only pre-order pickups allowed (building is closed).**\n\nThe Holliston Public Library at its permanent downtown location came into being in 1904 with donated land and funding from philanthropist Andrew Carnegie. An addition was built in 1987 and the library joined the Minuteman Library Network in 1994. Today we circulate 176,000 items per year with a staff of fifteen, six trustees and a dedicated group of volunteers and Friends.",
    "address": "752 Washington Street, Holliston, MA 01746",
    "telephone": "508-429-0617",
    "url": "https://www.hollistonlibrary.org/",
    "twitterurl": "https://twitter.com/hollistonlib",
    "hoursurl": "https://www.hollistonlibrary.org/hours.asp",
    "title": "Holliston Public Library"
  },
  {
    "status": "open",
    "statusdate": "13-March",
    "type": "academic",
    "name": "Framingham State University (Henry Whittemore Library)",
    "description": "The Henry Whittemore Library is a vital, vibrant part of the Framingham State University community.  Through dedicated customer service, the Library supports and advances the University’s academic and cultural missions by providing current and relevant resources and technologies. The Library is a seven level structure that also contains classrooms, academic departments and other facilities and includes spacious reading areas, a Café and wireless access throughout. In addition to the Library’s main collection, patrons have access to the Curriculum Library with children’s literature, resources for Education majors, and online materials from NASA. The Library’s Special Collections has rare books on the history of education, American poetry and travel, cookbooks, and the Christa McAuliffe collection. The Archives includes photographs, videotapes, journals, and documents related to the history of the University.",
    "address": "100 State Street, Framingham, MA 01701",
    "telephone": "508-626-4650",
    "url": "https://www.framingham.edu/academics/henry-whittemore-library/",
    "twitterurl": "https://twitter.com/whittemorelib",
    "hoursurl": "https://www.framingham.edu/academics/henry-whittemore-library/about-us/hours/",
    "title": "Framingham State University (Henry Whittemore Library)"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Acton Memorial Library",
    "description": "**The Acton Memorial Library is closed as of March 14, 2020.** \n\nThe Acton Memorial Library has been serving the Acton community for over 128 years. The busy library circulates over 500,000 items per year in addition to offering programming for all ages and meeting space for local groups. It has a collection of 170,000 items including books, audiobooks, DVDs, CDs, e-resources, periodicals, foreign language materials, and some non-traditional items such as Wi-Fi hotspots, telescopes, and a microscope.\n ",
    "address": "486 Main Street, Acton, MA 01720",
    "telephone": "978-929-6655",
    "url": "https://www.actonmemoriallibrary.org/",
    "twitterurl": "https://twitter.com/actonmemlibrary",
    "hoursurl": "https://www.actonmemoriallibrary.org/about-the-library/hours-and-directions/",
    "title": "Acton Memorial Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Robbins Library",
    "description": "**The Robbins and Fox Libraries are closed as of March 13, 2020.** \n\nThe Robbins Library was dedicated on November 29, 1892. The funds for the building came as a gift to the Town of Arlington from Maria C. Robbins in memory of her husband, Eli Robbins. The Fox Branch Library, formerly known as the East Arlington Branch of the Robbins Library, was established in 1916. Today, Arlington’s libraries are vital community centers for all. We create opportunities for lifelong learning, personal fulfillment and enjoyment that make Arlington a great place to live, work, study, and visit.",
    "address": "700 Massachusetts Avenue, Arlington, MA 02476",
    "telephone": "781-316-3200",
    "url": " https://www.robbinslibrary.org",
    "twitterurl": "https://twitter.com/RobbinsLib",
    "hoursurl": "https://www.robbinslibrary.org",
    "title": "Robbins Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Bedford Free Public Library",
    "description": "**The Bedford Free Public Library is closed as of March 13, 2020.** \n\nThe Bedford Free Public Library was founded in 1876 by a group of townspeople.  While its goal was to serve the entire community, it was supported by private funds and governed by a private corporation.  The early members of the Library Corporation saw the Library not only as a provider of books, but as an “educator” in a broader sense.  Today, the increased space has allowed the Library to offer more resources, services, and programs to the community, such as more space to expand print, audio, and DVD collections; a separate Children’s Room with storytime space; a young adult area; more meeting and study rooms; more space to work and read, and the uses of interior space are dynamic to meet changing needs.",
    "address": "7 Mudge Way, Bedford, MA 01730",
    "telephone": "781-275-9440 TTY: 781-275-9440",
    "url": "http://www.bedfordlibrary.net/",
    "twitterurl": "https://twitter.com/BedfordFreePL",
    "hoursurl": "http://www.bedfordlibrary.net/about/hours/",
    "title": "Bedford Free Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Belmont Public Library",
    "description": "** The Belmont Public Library is closed as of March 13, 2020.** \n\nThe Belmont Public Library is centrally located on Concord Avenue between the Town Hall complex and Belmont High school campus. A fixture for Belmontonians for over 150 years, and in it’s current space for over 50 years. Today we circulate over 550,000 items each year making us one of the most successful stand-alone Libraries in the Commonwealth. With a staff of 50+, and several dedicated boards including our Board of Trustees we are proud to service Belmont and the surrounding towns.",
    "address": "336 Concord Avenue, Belmont, MA 02478",
    "telephone": "617-489-2000",
    "url": "https://belmontpubliclibrary.net/",
    "twitterurl": "https://twitter.com/belmontlibma",
    "hoursurl": "https://belmontpubliclibrary.net/contact/",
    "title": "Belmont Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Public Library of Brookline",
    "description": "** The Public Library of Brookline, Coolidge Corner Branch and Putterham Branch are closed as of March 13th.** \n\nThe Public Library of Brookline promotes discovery, connection, and opportunity for all residents. Through our diverse resources and innovative programs, we aim to enrich the lives of our citizens through free access to information in many different media and formats. We are a cultural destination and a site for learning and recreation, as well as a place where people come together to exchange ideas. We strive to be both a cornerstone of our community and a gateway to explorations of a wider world.",
    "address": "361 Washington Street, Brookline, MA 02445",
    "telephone": "617-730-2370",
    "url": "https://www.brooklinelibrary.org/",
    "twitterurl": "https://twitter.com/brklib",
    "hoursurl": "https://www.brooklinelibrary.org/about/locations-hours/",
    "title": "Public Library of Brookline"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Cambridge Public Library",
    "description": "** The Cambridge Public Library and all Branches are closed as of March 14, 2020.** \n\nThe Cambridge Public Library serves as a doorway to opportunity, self-development and recreation for all its residents, and as a forum where they may share ideas, cultures and resources among themselves and with people around the globe. The free availability of information, the lively interaction of people, and the open exchange of ideas animate and extend the democratic mission of the library.\n\nThe library is a dynamic, community-oriented system providing excellent services, collections and programs to all members of the community. We are dedicated to affording the people of Cambridge resources for recreational reading, independent learning, and the introduction of children to the world of literacy and learning.\n\nThe Cambridge Public Library is designed to work as a unified system with a strong main library and six active branch libraries each tailored to the unique constituencies and needs of its immediate neighborhood.\n\nThe Main Library has been located in the geographic center of the city since 1889 and consists of two facilities: the Van Brunt and Howe Richardsonian building constructed between 1889 and 1902 and the new addition which opened in 2009. The Main Library is accessible by both bus and subway.",
    "address": "449 Broadway, Cambridge, MA 02138",
    "telephone": "617-349-4041",
    "url": "http://www.cambridgema.gov/cpl",
    "twitterurl": "https://twitter.com/cambridgepl",
    "hoursurl": "https://www.cambridgema.gov/cpl/hoursandlocations/mainlibrary",
    "title": "Cambridge Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Concord Free Public Library",
    "description": "** The Concord Free Public Library and Fowler Branch are closed as of March 13, 2020.** \n\nThe mission of the Concord Free Public Library is to inspire lifelong learning and to actively promote personal enrichment by connecting community members to information, ideas, culture, unique historical resources, and each other in a tradition of innovation and excellence.",
    "address": "129 Main Street, Concord, MA 01742",
    "telephone": "978-318-3300",
    "url": "https://concordlibrary.org/",
    "twitterurl": "https://twitter.com/ConcordLibrary",
    "hoursurl": "https://concordlibrary.org/about/hours-and-directions",
    "title": "Concord Free Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Dedham Public Library",
    "description": "** The Dedham Public Library and Endicott Branch Library are closed as of March 14, 2020.** \n\nThe Dedham Public Library provides free and equitable access to information while valuing and fostering learning and creative human potential in a safe, fun, and collaborative environment.  We empower and inspire discovery, inquiry, growth, and the application of knowledge in a community of kindness locally and beyond.",
    "address": "43 Church Street, Dedham, MA 02026",
    "telephone": "781-751-9284",
    "url": "http://www.dedhamlibrary.com/",
    "twitterurl": "https://twitter.com/DedhamPubLib",
    "hoursurl": "http://www.dedhamlibrary.com/about-us/",
    "title": "Dedham Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Dover Town Library",
    "description": "** The Dover Town Library is closed as of March 13, 2020.** \n\nWelcome to the Dover Town Library! Since the establishment of a free public library in Dover in 1894, the town has recognized the need for the preservation of knowledge and ideas, and access to that information for all. That recognition continues today within the walls of the Dover Town Library, where you will find a warm and welcoming environment providing traditional services that support the reading and informational needs and interests of all of our patrons in a variety of formats, including print and multimedia.",
    "address": "56 Dedham Street, Dover, MA 02030",
    "telephone": "508-785-8113",
    "url": "http://dovertownlibrary.org/",
    "hoursurl": "http://dovertownlibrary.org/about/location-hours/",
    "title": "Dover Town Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Framingham Public Library",
    "description": "** The Framingham Public Library and Christa McAuliffe Branch Library are closed as of March 14, 2020.** \n\nPoised at the nexus of education, arts enrichment, and civic innovation, the Framingham Public Library is the City's hub for gathering, connecting, and experiential learning. Visit our Citizenship Corner, attend a concert, take a hands on technology workshop, or find your own space to read, explore, or connect with friends or colleagues. From Lifelong Learning to English Language Learning plus innovative collections like our Library of Things, the Main Library is the destination for all in the City of Framingham.",
    "address": "49 Lexington Street, Framingham, MA 01702",
    "telephone": "508-532-5570 TTY: 508-872-2775",
    "url": "https://framinghamlibrary.org/",
    "twitterurl": "https://twitter.com/FramPub",
    "hoursurl": "https://framinghamlibrary.org/about/hours-locations/",
    "title": "Framingham Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Franklin Public Library",
    "description": "** The Franklin Public Library is closed as of March 13, 2020.** \nThe Franklin Public Library is considered America's first public library. In 1778, when the town was incorporated, the designated name Exeter was changed to Franklin in honor of Dr. Benjamin Franklin. In return Franklin was asked to donate a bell for the town's church steeple. Acknowledging that \"sense\" was preferable to \"sound\", Dr. Franklin responded with an offer of books for the use of the town's residents. When the volumes arrived, a great controversy arose over who should be allowed to use them. On November 20th, 1790, those attending Franklin's town meeting voted to lend the books to all Franklin inhabitants free of charge. This vote established the Franklin collection as the first public library in the United States.",
    "address": "118 Main Street, Franklin, MA 02038",
    "telephone": "508-520-4941",
    "url": "http://www.franklinma.gov/franklin-public-library",
    "twitterurl": "https://twitter.com/FrkPublicLib",
    "hoursurl": "http://www.franklinma.gov/franklin-public-library",
    "title": "Franklin Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Cary Memorial Library",
    "description": "** The Cary Library is closed as of March 13, 2020.** \n\nThe Cary Library’s Mission is to ignite curiosity, engage minds, and connect our community. We are more than a place where books are stored; we are a place where ideas are created, discovered, and shared. We help users navigate changes in information and technology, explore new formats, and experiment with innovative devices in an environment where both experts and novices are welcome. Cary Library in Lexington provides space to learn, explore, and meet others.",
    "address": "1874 Massachusetts Avenue, Lexington, MA 02420",
    "telephone": "781-862-6288",
    "url": "https://www.carylibrary.org",
    "twitterurl": "https://twitter.com/carymemlibrary",
    "hoursurl": "https://www.carylibrary.org/hours",
    "title": "Cary Memorial Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Lincoln Public Library",
    "description": "** The Lincoln Public Library is closed as of March 14, 2020.** \n\nSince its opening in 1884 the Lincoln Public Library has served as both the physical and cultural center of Lincoln.  We provide a full range of programming for all ages, from baby-time story hours to history lectures for our adult users.  Our collection of 199,867 volumes (85,800 in physical format and over 100,000 downloadable titles) yielded a circulation of over 171,000 in 2018.  The Library also provides museum passes to over 20 museums and cultural institutions throughout the Boston area. These passes are available to any member of the Minuteman Library Network, not just Lincoln residents.  The Lincoln Library strives to be a welcoming place for all library users.",
    "address": "3 Bedford Road, Lincoln, MA 01773",
    "telephone": "781-259-8465",
    "url": "http://www.lincolnpl.org/",
    "twitterurl": "http://twitter.com/lincolnpl",
    "hoursurl": "http://www.lincolnpl.org/about/hours",
    "title": "Lincoln Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Maynard Public Library",
    "description": "** The Maynard Public Library is closed as of March 15, 2020.** \n\nThe Maynard Public Library in downtown Maynard has served the community as a center for self-education, culture, recreation, and information, via materials and programs, since 1881. In 2006 after a massive interior renovation, the library moved in to its current home, formerly the Roosevelt Elementary School on 77 Nason Street. We hope that you will be a frequent visitor and user of our collections, programs, museum passes, online databases, and other services.",
    "address": "77 Nason Street, Maynard, MA 01754",
    "telephone": "978-897-1010",
    "url": "http://www.maynardpubliclibrary.org/",
    "twitterurl": "http://www.twitter.com/maynardlibrary",
    "hoursurl": "http://www.maynardpubliclibrary.org/",
    "title": "Maynard Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Medfield Public Library",
    "description": "** The Medfield Public Library is closed as of March 13, 2020.** \n\nThe mission of the Medfield Public Library is to be a community meeting house for learning growth and more. We strengthen our community by offering space, support, diverse programs for all ages and materials to inspire learning, creativity and the exchange of information.",
    "address": "468 Main Street, Medfield, MA 02052",
    "telephone": "508-359-4544",
    "url": "http://www.medfieldpubliclibrary.org",
    "twitterurl": "https://twitter.com/medfieldlibrary",
    "hoursurl": "http://www.medfieldpubliclibrary.org/about/hours-holiday-closures/",
    "title": "Medfield Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Medford Public Library",
    "description": "** The Medford Public Library is closed as of March 15, 2020.** \n\nThere is something for everyone at the MPL!  We have been a center for community activity since 1855 and we are busier than ever in the 21st century.  We welcomed almost 193,000 visitors in 2017.  We have great collections, a skilled staff, a lot of electronic resources, and a great sense of humor.  Come and visit or keep an eye on our website for all the activities and new building news.\n\nIn 2017, we received a grant from the Board of Library Commissioners to construct a new building so our future is bright. We are currently operating at 200 Boston Avenue, Suite G-350 until the new building is completed.",
    "address": "200 Boston Ave., Suite G-350, Medford, MA 02155",
    "telephone": "781-395-7950",
    "url": "http://www.medfordlibrary.org/",
    "twitterurl": "https://twitter.com/medfordlib",
    "hoursurl": "http://www.medfordlibrary.org/",
    "title": "Medford Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Medway Public Library",
    "description": "**Closed as of 16-March** \n\nThe Medway Public Library is dedicated to providing dynamic collections, innovative programs, and wide ranging and sustainable services to patrons of all ages. Our vision is to be an essential and reliable partner in the delivery of information resources, education, self-advancement, and recreation to residents of Medway and the surrounding area.",
    "address": "26 High Street, Medway, MA 02053",
    "telephone": "508-533-3217",
    "url": "http://www.medwaylib.org",
    "hoursurl": "http://www.medwaylib.org",
    "title": "Medway Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Millis Public Library",
    "description": "** The Millis Public Library is closed as of March 16, 2020.** \n\nThe mission of the Millis Public Library is to inspire lifelong learning by providing services, materials, and activities that engage the imagination, foster literacy, inspire intellectual curiosity, and advance the pursuit of knowledge for all members of the community. The library provides free and open access to recreational, educational, historical, and technological resources and hosts a diverse selection of activities that are open to the entire community.",
    "address": "961 Main Street, Millis, MA 02054",
    "telephone": "508-376-8282",
    "url": "http://www.millislibrary.org",
    "twitterurl": "https://twitter.com/millislibrary",
    "hoursurl": "http://www.millislibrary.org/hours/",
    "title": "Millis Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Morse Institute Library",
    "description": "** The Morse Institute and Bacon Free Libraries are closed as of March 13.**  Holds may be picked up via phone in selected parking spots.\n\nThe Morse Institute Library is the place where people of Natick and the MetroWest area can learn, enjoy and enrich their lives. Our mission is to provide free access to print and non-print materials and quality reference service to library users of all ages and abilities; to serve as a major educational resource with programs and hands-on learning opportunities for all residents of Natick and the MetroWest area; and to serve as a community and cultural center with meeting and exhibit spaces for individuals as well as municipal and civic groups.",
    "address": "14 East Central Street, Natick, MA 01760",
    "telephone": "508-647-6520",
    "url": "https://morseinstitute.org/",
    "twitterurl": "https://twitter.com/morseinstitute",
    "hoursurl": "https://morseinstitute.org/about/",
    "title": "Morse Institute Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Needham Free Public Library",
    "description": "** The Needham Free Public Library is closed as of March 14, 2020.** \n\nEstablished in 1888, the Needham Free Public Library provides access to materials, resources, and information in its endeavor to expand minds, celebrate diversity, embrace differences, and build community.  The Adult, Teen, and Children's Departments are vibrant and welcoming places that present a variety of materials and programs that will appeal to everyone.",
    "address": "1139 Highland Avenue, Needham, MA 02494",
    "telephone": "781-455-7559",
    "url": "http://www.needhamma.gov/index.aspx?nid=3031",
    "hoursurl": "http://www.needhamma.gov/index.aspx?nid=3158",
    "title": "Needham Free Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Newton Free Library",
    "description": "** The Newton Free Library is closed as of March 13, 2020.** \n\nThe Newton Free Library brings the community together to enjoy, explore, create, and discover.",
    "address": "330 Homer Street, Newton, MA 02459",
    "telephone": "617-796-1360",
    "url": "http://newtonfreelibrary.net/",
    "twitterurl": " https://twitter.com/NewtonFreeLib",
    "hoursurl": "http://newtonfreelibrary.net/",
    "title": "Newton Free Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Morrill Memorial Library",
    "description": "** The Morrill Memorial Library is closed as of March 15, 2020.** \n\nThe Morrill Memorial Library has been situated at the western end of the Norwood town center for over 120 years. The Library was a gift from Mr. and Mrs. George Morrill in memory of their daughter Sarah Bond Morrill. Mr. Morrill, a wealthy printing ink manufacturer, loved the design of the Lithgow Library and Reading Room in Augusta, Maine (1986) and commissioned the architect to design a sister library in Norwood. The Morrill Memorial Library and its furnishings and collection were turned over to the Town of Norwood in 1898. Several additions (1928 and 1965) and a complete renovation in 2001 have kept the Library a cultural, educational and recreational center into the 21st Century.",
    "address": "33 Walpole Street, Norwood, MA 02062",
    "telephone": "781-769-0200",
    "url": "http://www.norwoodlibrary.org/",
    "twitterurl": "https://twitter.com/Norwood_Library",
    "hoursurl": "http://www.norwoodlibrary.org/",
    "title": "Morrill Memorial Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Sherborn Library",
    "description": "** The Sherborn Library is closed as of March 13, 2020.** \n\nThe Sherborn Library was a gift to the Town in 1971 from Richard and Mary B. Saltonstall, devoted residents of Sherborn for more than 50 years.  Designed by local architect James A.S. Walker, the Library commands a prominent place in the hearts and minds of Sherborn residents.  “Although it is a contemporary building,” the journal New England Architect noted in its cover story on the new Library in September 1972, “the vocabulary is based on a foundation of traditional New England materials which give it a timeless regional quality.”  In 2017, the Library began a major renovation and expansion of the building which captures the original design essence.  The Library is scheduled to reopen in fall 2018, offering the Sherborn community a children’s wing and story-time “tree house”, young adult social and study space, large and small public meeting rooms, new systems, furnishings, and technology.   Currently, Library services and collections are located in a temporary location, the 1858 Town House across the street from the construction site, as we eagerly await the completion of this magnificent project.",
    "address": "4 Sanger Street, Sherborn, MA 01770",
    "telephone": "508-653-0770",
    "url": "https://sherbornlibrary.org/",
    "twitterurl": "https://twitter.com/minlibnet",
    "hoursurl": "https://sherbornlibrary.org/",
    "title": "Sherborn Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Somerville Public Library",
    "description": "** The Somerville Public Library and both Branches are closed as of March 16, 2020.** \n\nThe Somerville Public Library is dedicated to providing services, materials, and space that meet the educational, cultural, recreational, and informational needs of all people in the community. From introducing libraries to young children and their families, to supporting their needs in school, through meeting their educational and recreational needs as adults, the Library and its information professionals support information literacy and 21st century library skills, life-long learning, freedom of information, and the reading, listening, viewing, and computing needs and enjoyment of the community.",
    "address": "79 Highland Avenue, Somerville, MA 02143",
    "telephone": "617-623-5000",
    "url": "https://www.somervillepubliclibrary.org/",
    "twitterurl": "https://twitter.com/SomervillePL",
    "hoursurl": "https://www.somervillepubliclibrary.org/library-community/hours-locations/central-library",
    "title": "Somerville Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Randall Library",
    "description": "** The Randall Library is closed as of March 13, 2020.** \n\nThe Randall Library's mission is to use its resources to contribute to individual and community informational, educational, cultural, recreational and social enjoyment and enrichment:\n1)  By providing patrons with free and equal access to high quality and continually updated multiformat, in-house and inter-library loan materials and internet access.\n2)  By retaining and cultivating an excellent, efficient and energetic library staff capable of providing general information, reference assistance, facilities management and special programming.\n3)  By maintaining and further developing as needed a safe, pleasant library building which serves the diverse needs of individual patrons and community groups.\n4)  By striving to  promote the value of reading and learning.\nThe Randall Library in Stow, MA, strives to achieve the goals of its mission effectively and economically.",
    "address": "365 Great Road, Stow, MA 01775",
    "telephone": "978-897-8572",
    "url": "https://www.stow-ma.gov/randall-library",
    "twitterurl": " https://twitter.com/RandallLibStow",
    "hoursurl": "https://www.stow-ma.gov/randall-library",
    "title": "Randall Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Goodnow Library",
    "description": "** The Goodnow Library will be closed as of March 16, 2020.** \n\nWelcome to the community hot spot! As the public library of Sudbury, MA, we have something for everyone, whether you’re 1 or 101. Beyond being a repository for books, we have the latest bestsellers in digital, and we carry blockbuster movies as well as indie flicks in DVD or Blu-ray. Our excellent programs for children, tweens, teens and adults draw families from not just Sudbury but also many surrounding towns. If you have a young child, we offer a program every day of the week. If you want an inspirational and fact-filled setting to work, we have free Wi-Fi and wireless printing, too. Or, if you want to meet up with your friends and have a cup of coffee, come to the library, where beverages and community gathering are always welcome!",
    "address": "21 Concord Street, Sudbury, MA 01776",
    "telephone": "978-443-1035",
    "url": "https://goodnowlibrary.org/",
    "twitterurl": "https://twitter.com/goodnowlibrary",
    "hoursurl": "https://goodnowlibrary.org/about/hours-and-directions/",
    "title": "Goodnow Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Waltham Public Library",
    "description": "** The Waltham Public Library is closed as of March 13, 2020.** \n\nWaltham Public Library traces its roots to 1865 when the town created what was then called the Free Town Library. Today, Waltham Public Library provides a diverse population with popular informational, recreational and educational resources and services, but we’re more than the materials we house. We are a community builder, a social hub, a meeting spot, a place for music, performance and art, a tutor, a coach, a job finder, a job creator, and a technology expert. Welcome to the Waltham Public Library. We’re glad you’re here.",
    "address": "735 Main Street, Waltham, MA 02451",
    "telephone": "781-314-3425 TTY: 781-314-3439",
    "url": "http://www.waltham.lib.ma.us/",
    "twitterurl": "https://twitter.com/walthamlibrary",
    "hoursurl": "http://www.waltham.lib.ma.us/hours_directions.php",
    "title": "Waltham Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Watertown Free Public Library",
    "description": "** The Watertown Free Public Library is closed as of March 14, 2020.** \n\nThe Watertown Free Public Library extends beyond its walls to connect people to ideas, information, education, creative opportunities, and to each other. While preserving the rich history of Watertown, the Watertown Free Public Library embraces the advancement of library service, inspires personal development, and promotes community. The library provides free recreation, entertainment, and enrichment. It welcomes and serves everyone.",
    "address": "123 Main Street, Watertown, MA 02472",
    "telephone": "617-972-6431",
    "url": "https://www.watertownlib.org/",
    "twitterurl": "https://twitter.com/watertownpublib",
    "hoursurl": "https://www.watertownlib.org/150/Hours-Directions",
    "title": "Watertown Free Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Wayland Free Public Library",
    "description": "**CLOSED as of 15-March** \n\nThe mission of the Wayland Free Public Library is to be a free and accessible marketplace of ideas, information, and culture that fosters learning, community, and information literacy for the residents of Wayland and MetroWest. The Library provides open and guided access to a wide variety of media and programs to inform, inspire, and empower all its patrons in their pursuit of lifelong learning, personal enrichment, and cultural understanding. In so doing, the Library seeks to promote the free exchange of ideas necessary to the effective conduct of a democracy in an ever-changing world. ",
    "address": "5 Concord Road, Wayland, MA 01778",
    "telephone": "508-358-2311",
    "url": "https://waylandlibrary.org/",
    "twitterurl": "https://twitter.com/waylandlib ",
    "hoursurl": "https://waylandlibrary.org/aboutus/about-wpl/location-hours/",
    "title": "Wayland Free Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Wellesley Free Library",
    "description": "** The Wellesley Free Library and both Branches are closed as of March 14, 2020.** \n\nThe Wellesley Free Library serves as a community gathering place, a cultural destination and a gateway to ideas for residents of all ages and interests.",
    "address": "530 Washington Street, Wellesley, MA 02482",
    "telephone": "781-235-1610",
    "url": "https://www.wellesleyfreelibrary.org",
    "twitterurl": "https://twitter.com/WellesleyLib",
    "hoursurl": "https://www.wellesleyfreelibrary.org/blog/branch/main-library/",
    "title": "Wellesley Free Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Weston Public Library",
    "description": "** The Weston Public Library is closed as of March 13, 2020.** \n\nThe Weston Public Library is the place where people of Weston and the MetroWest area can learn, enjoy and enrich their lives. Our mission is to provide free access to print and non-print materials and quality reference service to library users of all ages and abilities; to serve as a major educational resource with programs and hands-on learning opportunities for all residents of Weston and the MetroWest area; and to serve as a community and cultural center with meeting and exhibit spaces for individuals as well as municipal and civic groups.",
    "address": "87 School Street, Weston, MA 02493",
    "telephone": "781-786-6150",
    "url": "http://www.westonlibrary.org",
    "twitterurl": "http://www.twitter.com/WestonLibrary",
    "hoursurl": "http://www.westonlibrary.org/general-information-leftmenu/about-the-library",
    "title": "Weston Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Westwood Public Library",
    "description": "** The Westwood Public Library and Islington Branch Library are closed as of March 13, 2020.** \n\nThe Westwood Public Library has a long history, originally established in 1895 as a branch of the Dedham Public Library.  The site of the first library building, which was a gift to the town in 1895 from Howard Colburn, remains the approximate location of the new Westwood Public Library, which opened to the public in July 2013.  History surrounds the Islington Branch Library as well, which is housed in Wentworth Hall, a building which dates to 1884.  The vision for the Westwood Public Library is to provide excellent professional, educational and recreational resources for lifelong learning while fostering a culture of inclusion in a vibrant place that is free and welcoming to all.",
    "address": "660 High Street, Westwood, MA 02090",
    "telephone": "781-326-7562",
    "url": "http://www.westwoodlibrary.org",
    "hoursurl": "http://www.westwoodlibrary.org/about/hours-directions",
    "title": "Westwood Public Library"
  },
  {
    "status": "closed",
    "type": "public",
    "name": "Winchester Public Library",
    "description": "** The Winchester Public Library is closed as of March 15, 2020.** \n\nThe Winchester Public Library is a dynamic community resource that endeavors to improve the quality of life for its library patrons by providing the resources, services and support they need to make informed decisions, resolve issues or answer questions and explore topics of personal interest and to support intellectual growth throughout their lives.",
    "address": "80 Washington Street, Winchester, MA 01890",
    "telephone": "781-721-7171",
    "url": "http://www.winpublib.org/",
    "twitterurl": "https://twitter.com/winpublib",
    "hoursurl": "http://www.winpublib.org/about-the-library/hours",
    "title": "Winchester Public Library"
  },
  {
    "status": "unknown",
    "statusdate": "15-March",
    "type": "public",
    "name": "Woburn Public Library",
    "description": "The Woburn Public Library serves as the hub of the community, connecting residents to resources, services, and experiences that educate, enrich and entertain.",
    "address": "45 Pleasant Street, Woburn, MA 01801",
    "telephone": "781-933-0148",
    "url": "https://woburnpubliclibrary.org",
    "twitterurl": "https://twitter.com/woburnlibrary",
    "hoursurl": "https://woburnpubliclibrary.org/contact-us/",
    "title": "Woburn Public Library"
  },
  {
    "status": "unknown",
    "statusdate": "15-March",
    "type": "academic",
    "name": "Dean College (E. Ross Anderson Library)",
    "description": "The E. Ross Anderson Library at Dean College, located in the Green Family Library Learning Commons, offers rich collections in tangible and digital formats across the broad spectrum of disciplines represented at Dean College.  These collections are not only used by members of the campus community—they are accessible to anyone in the Minuteman Library Network and beyond.\n\nSince its establishment, the Library has played a critical role in the teaching, research, and service mission of the college, not only for the depth and breadth of its collections, but for the expertise of its librarians and staff, and its other support services.",
    "address": "99 Main St., Franklin, MA 02038",
    "telephone": "508-541-1771",
    "url": "https://www.dean.edu/student-life/library/",
    "twitterurl": "https://twitter.com/DeanCollege",
    "hoursurl": "https://www.dean.edu/student-life/library/",
    "title": "Dean College (E. Ross Anderson Library)"
  },
  {
    "status": "closed",
    "type": "academic",
    "name": "Lasell University (Brennan Library)",
    "description": "** CLOSED to the public; only accessible by students.** \n\nLasell University's Brennan Library is a learning commons that, in addition to its library and archive services, houses the Academic Achievement Center and the Center for First-Year Advising.  The library maintains a targeted collection of print materials, as well as popular fiction and DVDs, and a wide array of electronic materials to better serve our graduate and undergraduate students, as well as our faculty.   The Winslow Archives are located on the library's second floor, along with group study rooms and an instruction space.",
    "address": "80-A Maple Street, Newton, MA 02466",
    "telephone": "617-243-2244",
    "url": "https://www.lasell.edu/academics/academic-centers/brennan-library.html",
    "twitterurl": "https://twitter.com/laselllibrary",
    "hoursurl": "https://www.lasell.edu/academics/academic-centers/brennan-library/about-the-brennan-library/hours-and-calendar.html",
    "title": "Lasell University (Brennan Library)"
  },
  {
    "status": "closed",
    "type": "academic",
    "name": "Pine Manor College (Annenberg Library)",
    "description": "** Note: The Annenberg Library remains open to our students and faculty, but we are not currently open to other visitors as we observe prudent distancing protocols.** \n\nThe Annenberg Library offers a comfortable and inviting environment where the Pine Manor College community can access free resources designed with student success in mind. Our library is open to public Minuteman Library cardholders! Open 73 hours per week during the regular academic year, library facilities include a renovated computer lab, quiet spaces for serious study, community spaces for group study, and group or individual study rooms. The library also houses the Moncrief Special Collections, Hess Art Gallery, and the Class of 1912/Rauch Instructional Materials Room. The Library currently holds over 50,000 volumes and subscribes to a wide array of journals and periodicals in print and electronic formats to support the curriculum of Pine Manor College.",
    "address": "400 Heath Street, Chestnut Hill, MA 02467",
    "telephone": "617-731-7081",
    "url": "http://www.pmc.edu/library",
    "twitterurl": "https://twitter.com/pinemanorma",
    "hoursurl": "http://www.pmc.edu/library-calendar",
    "title": "Pine Manor College (Annenberg Library)"
  },
  {
    "status": "closed",
    "type": "academic",
    "name": "Regis College Library",
    "description": "** CLOSED to the public; only accessible by students.** \n\nThe Regis Library, on the Regis College campus, joins four other academic libraries in the Minuteman Library Network offering varied collections and reference services to the public. We welcome the opportunity to assist with research requests, and sharing our collections.",
    "address": "235 Wellesley Street, Weston, MA 02493",
    "telephone": "781-768-7302",
    "url": "http://www.regiscollege.edu/academics/library.cfm",
    "twitterurl": "https://twitter.com/RegisCollegeLib",
    "hoursurl": "http://www.regiscollege.edu/academics/lib-hours.cfm",
    "title": "Regis College Library"
  }
]
